#include<iostream>   // Подключение библиотеки
#include<clocale>    // Для корректной работы русского языка
using namespace std; // Подлючение пространства имено
int main() {
	setlocale(LC_ALL, "RU");
	char c;
	char b;
	cout << "Меню ресторана: \n" << "1 - Салаты\n" << "2 - Горячее блюдо\n" << "3 - Напитки\n" << "4 - Десерты\n"; // Заголовок
	cout << "Введите ваше блюдо(1, 2, 3 или 4): ";
	cin >> c;
	if (c == '1') {                            // Проверка выбора пользователя
		cout << "Меню салатов:\n";
		cout << "1.Оливье\n" << "2.Цезарь\n" << "3.Греческий\n";
		cout << "Введите ваш выбор: ";
		cin >> b;
		switch (b) {
		case '1':cout << "Вы выбрали - Оливье\nЦена: 250 Руб/100 гр.";break;
		case '2':cout << "Вы выбрали - Цезарь\nЦена: 300 Руб/100 гр.";break;
		case '3':cout << "Вы выбрали - Греческий\nЦена: 270 Руб/100 гр.";break;
		default:
			cout << "Ошибка";
			return 1;	// Для корректной работы после проверки
		}
	}

	else if (c == '2') {					// Проверка выбора пользователя
		cout << "Меню горячих блюд:\n";
		cout << "1.Борщ\n" << "2.Суп\n" << "3.Мясо по France\n";
		cout << "Введите ваш выбор: ";
		cin >> b;
		switch (b) {
		case '1':cout << "Вы выбрали - Борщ\nЦена: 120 Руб/100 гр.";break;
		case '2':cout << "Вы выбрали - Суп\nЦена: 150 Руб/100 гр.";break;
		case '3':cout << "Вы выбрали - Мясо по France\nЦена: 500 Руб/100 гр.";break;
		default:
			cout << "Ошибка";
			return 1;	// Для корректной работы после проверки
		}
	}
	else if (c == '3') {					// Проверка выбора пользователя
		cout << "Меню напитков:\n";
		cout << "1.Coca-cola\n" << "2.Sprite\n" << "3.White monster\n";
		cout << "Введите ваш выбор: ";
		cin >> b;
		switch (b) {
		case '1':cout << "Вы выбрали - Coca-cola\nЦена: 120 Руб/100 мл.";break;
		case '2':cout << "Вы выбрали - Sprite\nЦена: 100 Руб/100 мл.";break;
		case '3':cout << "Вы выбрали - White monster\nЦена: 200 Руб/100 мл.";break;
		default:
			cout << "Ошибка";
			return 1;	// Для корректной работы после проверки
		}
	}
	else if (c == '4') {					// Проверка выбора пользователя
		cout << "Меню десертов:\n";
		cout << "1.Чизкейк\n" << "2.Наполеон\n" << "3.Ромова Баба\n";
		cout << "Введите ваш выбор: ";
		cin >> b;
		switch (b) {
		case '1':cout << "Вы выбрали - Чизкейк\nЦена: 250 Руб/100 гр.";break;
		case '2':cout << "Вы выбрали - Наполеон\nЦена: 220 Руб/100 гр.";break;
		case '3':cout << "Вы выбрали - Ромова Баба\nЦена: 400 Руб/100 гр.";break;
		default:
			cout << "Ошибка";
			return 1;    // Для корректной работы после проверки
		}
	}
	else {
		cout << "Ошибка";
	}
	return 0; // Завершение работы
}

